# TemperatureRatings Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireMaterialType..::..TemperatureRatings Property
WireMaterialType Class See Also
---
Get all temperature rating type definitions defined in this wire material type.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public TemperatureRatingTypeSet TemperatureRatings { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TemperatureRatings As TemperatureRatingTypeSet
	Get
```

Visual C++
---
```text
public:
property TemperatureRatingTypeSet^ TemperatureRatings {
	TemperatureRatingTypeSet^ get ();
}
```

# See Also
WireMaterialType Class
Autodesk.Revit.DB.Electrical Namespace